//Написати програму для обчислення виразу
#include <iostream>
#include <cmath>
using namespace std;
int main()

{
	//Оголошення зміної
	double y, x, X;
	//Виведення користувацького повідомлення "введіть зміну У"
	cout<<"Vvedit y "<<endl;
	//Присвоєння веденого користувацького значення в зміну У
	cin>>y;
	//Виведення користувацького повідомлення "введіть зміну Х"
	cout<<"Vvedit x "<<endl;
	//Присвоєння веденого користувацького значення в зміну Х
	cin>>x;
	//Вирішення прикладу
	X = 5*atan(x)-1/4.*cos(x)*((x+3*abs(x-y)+pow(x,2)/pow(abs(x+pow(y,2)),1/3.)+pow(x,1/3.));
	//Виведення результату обчислення
	cout<<"x= "<<X;
	return 0;
}







